# Написати скрипт, який залишить в словнику тільки пари із унікальними значеннями (дублікати значень - видалити). Словник для
   # роботи захардкодити свій.
                # Приклад словника (не використовувати):
                # {'a': 1, 'b': 3, 'c': 1, 'd': 5}
                # Очікуваний результат:
                # {'a': 1, 'b': 3, 'd': 5}

sample_data = {1: 10, 2: 20, 3: 30, 4: 40, 5: 10, 6: 10}
new_dict={}
for key,value in sample_data.items():
	if value not in new_dict.values():
		new_dict[key] = value

print(new_dict)