# Написати скрипт, який отримає максимальне і мінімальне значення із словника. Дані захардкодити.
                # Приклад словника (можете використовувати свій):
                # dict_1 = {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}
                # Вихідний результат:
                # MIN: 10
                # MAX: 60

dict_1 = {30: 15, 22: 25, 33: 4, 4: 46, 5: 54, 6: 72}

values_list = dict_1.values()
min_value = min(values_list)
max_value = max(values_list)

print("MIN: ", min_value)
print("MAX: ", max_value)